In [1]:
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import pandas as pd
from IPython.display import display
from IPython.display import Image
sns.set_context("notebook")

# Extracting Data and Filtering
:The `[]` operator supports array of booleans as an input. In this case, the array must be exactly as long as the number of rows.

The result is a **filtered version of the data frame**, where **only rows corresponding to True appear**.

# Q1.
Select multiple criteria by creating multiple boolean Series and combining them using the `&` operator. For Examole Result is win and %win is more than 50.

In [2]:
import urllib.request
import os.path
import zipfile
import pandas as pd
import numpy as np

We will nowe work with a dataset containing the names of all babies born in California, USA. Visit the [Social Security Adminisitration Website](https://www.ssa.gov/oact/babynames/limits.html) for more details about the dataset if you want.

**Let's start by loading the Baby Names dataset.**

In [3]:
field_names = ['State', 'Sex', 'Year', 'Name', 'Count']

babynames = pd.read_csv('H:/Machine Learning/babynamesbystate/STATE.CA.TXT', header=None, names=field_names)

baby = babynames.copy()

In [4]:
baby.head(5)

  State Sex  Year      Name  Count
0    CA   F  1910      Mary    295
1    CA   F  1910     Helen    239
2    CA   F  1910   Dorothy    220
3    CA   F  1910  Margaret    163
4    CA   F  1910   Frances    134

# Q2.
Calculate the some statics of babynames DataFrame using Utility Functions, like .describe(), .size(), .shape() and report your analysis in comments

In [7]:
# .size()
print("The size is ",baby.size)

#Report -- size will return the total number of elements in the dataframe


#Shape
print("The shape is :: ",baby.shape)
#Report -- Shape will return the number of rows and number of column in the dataframe

# .describe()
print("The description of data is :: ",baby.describe())

#Report -- .describe() will show the basic description or information about data like mean,std,min etc

The size is  2037140
The shape is ::  (407428, 5)
The description of data is ::                  Year          Count
count  407428.000000  407428.000000
mean     1985.733609      79.543456
std        27.007660     293.698654
min      1910.000000       5.000000
25%      1969.000000       7.000000
50%      1992.000000      13.000000
75%      2008.000000      38.000000
max      2022.000000    8260.000000

# Q.3:

Using the babynames DataFrame that contains baby names data for the state of California, how can you use the 'isin' method to find out which records have names that are in a given list of names, such as "Emma," "Liam," and "Olivia," and what would be the output of this operation when applied to the first 15 rows of the DataFrame (babynames.head(15))?

In [9]:
# List of names to check
name_list = ["Emma", "Liam", "Olivia"]

# We can use isin method to filter records with names in the name_list
filtered_dataframe = baby[baby["Name"].isin(name_list)]

# Display the filtered DataFrame
filtered_dataframe.head(15)

#Report -- This will show the first 15 rows only

     State Sex  Year    Name  Count
53      CA   F  1910    Emma     29
293     CA   F  1911    Emma     29
525     CA   F  1912    Emma     56
701     CA   F  1912  Olivia      8
840     CA   F  1913    Emma     56
1168    CA   F  1914    Emma     65
1437    CA   F  1914  Olivia      6
1542    CA   F  1915    Emma     86
1869    CA   F  1915  Olivia      6
2009    CA   F  1916    Emma     78
2195    CA   F  1916  Olivia     12
2467    CA   F  1917    Emma     95
2639    CA   F  1917  Olivia     15
2958    CA   F  1918    Emma     83
3136    CA   F  1918  Olivia     15

# Q.4:
How can you use the 'str.startswith' method in pandas to filter records in a babyname DataFrame? Provide an example code using the babynames DataFrame and explain how this method can be employed to extract data for baby names that begin with 'A' or 'B' set of letters.

In [10]:
# Filter rows where the 'Name' column starts with 'A'
str_filter = baby[(baby["Name"].str.startswith("A")) |( baby["Name"].str.startswith("B"))]
# Display the filtered DataFrame
print("Baby names starting with 'A' and B:",str_filter)

Baby names starting with 'A' and B:        State Sex  Year     Name  Count
7         CA   F  1910    Alice    118
23        CA   F  1910  Bernice     59
31        CA   F  1910     Anna     51
32        CA   F  1910      Ann     47
36        CA   F  1910    Betty     40
...      ...  ..   ...      ...    ...
407125    CA   M  2022   Brando      5
407126    CA   M  2022  Braxtyn      5
407127    CA   M  2022  Brenden      5
407128    CA   M  2022     Brix      5
407129    CA   M  2022    Broly      5

[61691 rows x 5 columns]

# Q.5

Find the most popular baby name in California in 2012

__Exercise__: Try to find the most popular baby name by finding the maximum value for 'Count' and then apply filtering to find the name.

In [11]:
data= baby[baby["Year"] == 2012]



data.loc[data["Count"].idxmax(),"Name"]

'Sophia'

# Q. 6
Find baby names that start with J, in th Year from 2001 to 2019

*Note: To answer this question, we need a way to look at the individual characters of the baby names*

In [12]:
# Note: Series has powerful string manipulation methods associated with it

baby[(baby["Year"] >= 2001)  & (baby["Year"] <= 2019)][baby["Name"].str.startswith("J")]

C:\Users\Usman\AppData\Local\Temp\ipykernel_6196\857156259.py:3: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  baby[(baby["Year"] >= 2001)  & (baby["Year"] <= 2019)][baby["Name"].str.startswith("J")]

       State Sex  Year         Name  Count
152826    CA   F  2001      Jessica   2244
152828    CA   F  2001     Jennifer   2027
152832    CA   F  2001      Jasmine   1655
152847    CA   F  2001   Jacqueline   1195
152857    CA   F  2001        Julia    983
...      ...  ..   ...          ...    ...
398685    CA   M  2019  Joseantonio      5
398686    CA   M  2019       Jovian      5
398687    CA   M  2019       Jujhar      5
398688    CA   M  2019      Jullian      5
398689    CA   M  2019         June      5

[11276 rows x 5 columns]

# Q.7
Add a new column called "name_length" to the babynames DataFrame, you can use .str.len() in existing Name column. Moreover. also modify the Length values with new values like existing_value-1 and rename the length column with new label as desceribe in slides.

In [13]:
# Calculate the length of each name and add it as a new column "_length"
baby["name_length"] = baby["Name"].str.len()

# Display the updated DataFrame
baby.head(4)


# Rename the "_length" column to "Length"
baby.rename(columns={"name_length":"Length"},inplace=True)

baby

       State Sex  Year      Name  Count  Length
0         CA   F  1910      Mary    295       4
1         CA   F  1910     Helen    239       5
2         CA   F  1910   Dorothy    220       7
3         CA   F  1910  Margaret    163       8
4         CA   F  1910   Frances    134       7
...      ...  ..   ...       ...    ...     ...
407423    CA   M  2022   Zayvier      5       7
407424    CA   M  2022       Zia      5       3
407425    CA   M  2022      Zora      5       4
407426    CA   M  2022    Zuriel      5       6
407427    CA   M  2022      Zylo      5       4

[407428 rows x 6 columns]

In [ ]:
print("After adding values the dataframe becomes :: ")
baby

After adding values the dataframe becomes ::

       State Sex  Year      Name  Count  Length
0         CA   F  1910      Mary    295       4
1         CA   F  1910     Helen    239       5
2         CA   F  1910   Dorothy    220       7
3         CA   F  1910  Margaret    163       8
4         CA   F  1910   Frances    134       7
...      ...  ..   ...       ...    ...     ...
407423    CA   M  2022   Zayvier      5       7
407424    CA   M  2022       Zia      5       3
407425    CA   M  2022      Zora      5       4
407426    CA   M  2022    Zuriel      5       6
407427    CA   M  2022      Zylo      5       4

[407428 rows x 6 columns]


# Q.8

Use .str.split() to sample the names with 'ad' string and show first 10 samples.

In [14]:
#new = baby.sample(10,baby["Name"].str.contains("ad"),replace=True)


new = baby[baby["Name"].str.contains("ad")].sample(10, replace=True)
print(new)

       State Sex  Year            Name  Count  Length
82660     CA   F  1979          Azadeh      6       6
255176    CA   M  1941            Chad      6       4
146574    CA   F  1999         Ariadna     24       7
130540    CA   F  1994            Kady      6       4
105625    CA   F  1987        Mariadel      5       8
399287    CA   M  2020           Brady     81       5
267204    CA   M  1956        Salvador    119       8
119906    CA   F  1991  Mariadelcarmen      5      14
335762    CA   M  1997           Caden     29       5
367158    CA   M  2009           Aaden    158       5

More on str methods when we'll study regular expressions in this course. Note that there are other approaches that we can use to find the same answer as above.

In [15]:
# Create a boolean mask for rows containing 'ad' in the "Name" column

mask = baby["Name"].str.contains("ad")

# Use the mask to select rows and sample 5 random rows

baby[mask].sample(5,replace=True)

       State Sex  Year       Name  Count  Length
294715    CA   M  1978  Guadalupe     68       9
19508     CA   F  1942       Nada      6       4
38485     CA   F  1957    Soledad      7       7
389213    CA   M  2016       Aadi      8       4
346095    CA   M  2001      Grady     14       5

# Q.9
 Sort names by their length.

In the babynames DataFrame, which baby name appears most frequently across all years and states, and how can you use pandas to find this information? Provide the code and steps to determine the most popular baby name in the dataset.

In [19]:


# Group the data by "Name" and sum the "Count" for each name
cont  = baby.groupby("Name")["Count"].sum()


# Find the name with the highest total count
most_popular = cont.sort_values(ascending=False).head(1)

# Display the most popular name and its count
most_popular

Name
Michael    435716
Name: Count, dtype: int64

# Q.10

1: How can you use the .sample() method to randomly select a single row from the babynames DataFrame, and what is the purpose of such a selection?

2: Suppose you want to generate a random sample of 10 baby names from the babynames DataFrame. How would you use the .sample() method to achieve this, and what parameters or arguments would you specify?

3: In a scenario where you need to ensure reproducibility, explain how you can set a random seed when using the .sample() method in pandas. Why might this be important in certain data analysis tasks?

4: You want to perform a bootstrap resampling analysis on the baby names data in the babynames DataFrame. Describe how you can repeatedly sample with replacement using .sample() to create multiple bootstrap samples for statistical analysi

In [22]:
# 1- How can you use the .sample() method

#The purpose of the sample is to randomly select the rows from our dataframe 
baby.sample(4)


#2- 10 samples from dataframe
baby.sample(10,replace=True)
#we can use replace in the sample to ensure that we are not loosing our original data


#3- Using seed for producing same results
np.random.seed(0)  #When we set the seed value every time the results of sample will be same
baby.sample(5,replace=True)

       State Sex  Year      Name  Count  Length
305711    CA   M  1984   Mathieu     11       7
117952    CA   F  1991  Lizzette     15       8
152315    CA   F  2000    Ambika      5       6
358083    CA   M  2005    Shamar      5       6
359783    CA   M  2006   Sammuel     10       7

# Q.11
1: The code randomly mixes up the list of baby names. Why might someone want to do this, and how could it affect the analysis of the names?

2: After mixing, the code figures out how long each baby name is. Why would we care about name lengths, and what can this tell us about the names?

3: The code arranges the name lengths from longest to shortest. Why might we want to do this, and what could it help us find in the data?

4: The code finds the order of baby names based on their lengths and shows us the first few names in this new order. When might we need to organize names this way, and what might we discover from the first few names in this order?

In [ ]:
#Anaswer 1--- Randomly mixing up the list of baby names ensures that the analysis is not influenced by the order in which the names 
#appear also it helps  in checking the more diverse smaple of names for analysis


#Answer 2-In the context of data analysis, longer names consume more memory than shorter names because they require 
# more storage space to store the characters comprising the name.

#Answer 3 -- Arranging the name lengths from longest to shortest allows us to identify the distribution of name lengths. 
#    This sorting can help in visualizing the range of name lengths.

#Answer 4 -- Organizing the names based on their lengths can be useful in situations where we want to compare or categorize names by 
#their lengths.  By examining the first few names in this sorted order, 
#we can gain insights into the types of names that are prevalent or popular within certain length categories